{"class_name": "Model", "config": {"name": "model_19", "layers": [{"name": "input_28", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500000, 4, 1], "dtype": "float32", "sparse": false, "name": "input_28"}, "inbound_nodes": []}, {"name": "model_17", "class_name": "Model", "config": {"name": "model_17", "layers": [{"name": "input_25", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500000, 4, 1], "dtype": "float32", "sparse": false, "name": "input_25"}, "inbound_nodes": []}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 256, "kernel_size": [10, 4], "strides": [1, 4], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "res1a_branch2a", "class_name": "Conv2D", "config": {"name": "res1a_branch2a", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [2, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "bn1a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn1a_branch2a", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1a_branch2a", 0, 0, {}]]]}, {"name": "activation_139", "class_name": "Activation", "config": {"name": "activation_139", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1a_branch2a", 0, 0, {}]]]}, {"name": "res1a_branch2b", "class_name": "Conv2D", "config": {"name": "res1a_branch2b", "trainable": true, "filters": 32, "kernel_size": [2, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_139", 0, 0, {}]]]}, {"name": "bn1a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn1a_branch2b", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1a_branch2b", 0, 0, {}]]]}, {"name": "activation_140", "class_name": "Activation", "config": {"name": "activation_140", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1a_branch2b", 0, 0, {}]]]}, {"name": "res1a_branch2c", "class_name": "Conv2D", "config": {"name": "res1a_branch2c", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_140", 0, 0, {}]]]}, {"name": "res1a_branch1", "class_name": "Conv2D", "config": {"name": "res1a_branch1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [2, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "bn1a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn1a_branch2c", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1a_branch2c", 0, 0, {}]]]}, {"name": "bn1a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn1a_branch1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1a_branch1", 0, 0, {}]]]}, {"name": "add_47", "class_name": "Add", "config": {"name": "add_47", "trainable": true}, "inbound_nodes": [[["bn1a_branch2c", 0, 0, {}], ["bn1a_branch1", 0, 0, {}]]]}, {"name": "activation_141", "class_name": "Activation", "config": {"name": "activation_141", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_47", 0, 0, {}]]]}, {"name": "res1b_branch2a", "class_name": "Conv2D", "config": {"name": "res1b_branch2a", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [5, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_141", 0, 0, {}]]]}, {"name": "bn1b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn1b_branch2a", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1b_branch2a", 0, 0, {}]]]}, {"name": "activation_142", "class_name": "Activation", "config": {"name": "activation_142", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1b_branch2a", 0, 0, {}]]]}, {"name": "res1b_branch2b", "class_name": "Conv2D", "config": {"name": "res1b_branch2b", "trainable": true, "filters": 64, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_142", 0, 0, {}]]]}, {"name": "bn1b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn1b_branch2b", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1b_branch2b", 0, 0, {}]]]}, {"name": "activation_143", "class_name": "Activation", "config": {"name": "activation_143", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1b_branch2b", 0, 0, {}]]]}, {"name": "res1b_branch2c", "class_name": "Conv2D", "config": {"name": "res1b_branch2c", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_143", 0, 0, {}]]]}, {"name": "res1b_branch1", "class_name": "Conv2D", "config": {"name": "res1b_branch1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [5, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_141", 0, 0, {}]]]}, {"name": "bn1b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn1b_branch2c", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1b_branch2c", 0, 0, {}]]]}, {"name": "bn1b_branch1", "class_name": "BatchNormalization", "config": {"name": "bn1b_branch1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1b_branch1", 0, 0, {}]]]}, {"name": "add_48", "class_name": "Add", "config": {"name": "add_48", "trainable": true}, "inbound_nodes": [[["bn1b_branch2c", 0, 0, {}], ["bn1b_branch1", 0, 0, {}]]]}, {"name": "activation_144", "class_name": "Activation", "config": {"name": "activation_144", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_48", 0, 0, {}]]]}, {"name": "res1c_branch2a", "class_name": "Conv2D", "config": {"name": "res1c_branch2a", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [2, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_144", 0, 0, {}]]]}, {"name": "bn1c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn1c_branch2a", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1c_branch2a", 0, 0, {}]]]}, {"name": "activation_145", "class_name": "Activation", "config": {"name": "activation_145", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1c_branch2a", 0, 0, {}]]]}, {"name": "res1c_branch2b", "class_name": "Conv2D", "config": {"name": "res1c_branch2b", "trainable": true, "filters": 64, "kernel_size": [2, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_145", 0, 0, {}]]]}, {"name": "bn1c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn1c_branch2b", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1c_branch2b", 0, 0, {}]]]}, {"name": "activation_146", "class_name": "Activation", "config": {"name": "activation_146", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1c_branch2b", 0, 0, {}]]]}, {"name": "res1c_branch2c", "class_name": "Conv2D", "config": {"name": "res1c_branch2c", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_146", 0, 0, {}]]]}, {"name": "res1c_branch1", "class_name": "Conv2D", "config": {"name": "res1c_branch1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [2, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_144", 0, 0, {}]]]}, {"name": "bn1c_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn1c_branch2c", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1c_branch2c", 0, 0, {}]]]}, {"name": "bn1c_branch1", "class_name": "BatchNormalization", "config": {"name": "bn1c_branch1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1c_branch1", 0, 0, {}]]]}, {"name": "add_49", "class_name": "Add", "config": {"name": "add_49", "trainable": true}, "inbound_nodes": [[["bn1c_branch2c", 0, 0, {}], ["bn1c_branch1", 0, 0, {}]]]}, {"name": "activation_147", "class_name": "Activation", "config": {"name": "activation_147", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_49", 0, 0, {}]]]}, {"name": "res1d_branch2a", "class_name": "Conv2D", "config": {"name": "res1d_branch2a", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [5, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_147", 0, 0, {}]]]}, {"name": "bn1d_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn1d_branch2a", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1d_branch2a", 0, 0, {}]]]}, {"name": "activation_148", "class_name": "Activation", "config": {"name": "activation_148", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1d_branch2a", 0, 0, {}]]]}, {"name": "res1d_branch2b", "class_name": "Conv2D", "config": {"name": "res1d_branch2b", "trainable": true, "filters": 128, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_148", 0, 0, {}]]]}, {"name": "bn1d_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn1d_branch2b", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1d_branch2b", 0, 0, {}]]]}, {"name": "activation_149", "class_name": "Activation", "config": {"name": "activation_149", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1d_branch2b", 0, 0, {}]]]}, {"name": "res1d_branch2c", "class_name": "Conv2D", "config": {"name": "res1d_branch2c", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_149", 0, 0, {}]]]}, {"name": "res1d_branch1", "class_name": "Conv2D", "config": {"name": "res1d_branch1", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [5, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_147", 0, 0, {}]]]}, {"name": "bn1d_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn1d_branch2c", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1d_branch2c", 0, 0, {}]]]}, {"name": "bn1d_branch1", "class_name": "BatchNormalization", "config": {"name": "bn1d_branch1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1d_branch1", 0, 0, {}]]]}, {"name": "add_50", "class_name": "Add", "config": {"name": "add_50", "trainable": true}, "inbound_nodes": [[["bn1d_branch2c", 0, 0, {}], ["bn1d_branch1", 0, 0, {}]]]}, {"name": "activation_150", "class_name": "Activation", "config": {"name": "activation_150", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_50", 0, 0, {}]]]}, {"name": "res1e_branch2a", "class_name": "Conv2D", "config": {"name": "res1e_branch2a", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [2, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_150", 0, 0, {}]]]}, {"name": "bn1e_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn1e_branch2a", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1e_branch2a", 0, 0, {}]]]}, {"name": "activation_151", "class_name": "Activation", "config": {"name": "activation_151", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1e_branch2a", 0, 0, {}]]]}, {"name": "res1e_branch2b", "class_name": "Conv2D", "config": {"name": "res1e_branch2b", "trainable": true, "filters": 128, "kernel_size": [2, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_151", 0, 0, {}]]]}, {"name": "bn1e_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn1e_branch2b", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1e_branch2b", 0, 0, {}]]]}, {"name": "activation_152", "class_name": "Activation", "config": {"name": "activation_152", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1e_branch2b", 0, 0, {}]]]}, {"name": "res1e_branch2c", "class_name": "Conv2D", "config": {"name": "res1e_branch2c", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_152", 0, 0, {}]]]}, {"name": "res1e_branch1", "class_name": "Conv2D", "config": {"name": "res1e_branch1", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [2, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_150", 0, 0, {}]]]}, {"name": "bn1e_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn1e_branch2c", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1e_branch2c", 0, 0, {}]]]}, {"name": "bn1e_branch1", "class_name": "BatchNormalization", "config": {"name": "bn1e_branch1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1e_branch1", 0, 0, {}]]]}, {"name": "add_51", "class_name": "Add", "config": {"name": "add_51", "trainable": true}, "inbound_nodes": [[["bn1e_branch2c", 0, 0, {}], ["bn1e_branch1", 0, 0, {}]]]}, {"name": "activation_153", "class_name": "Activation", "config": {"name": "activation_153", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_51", 0, 0, {}]]]}, {"name": "res1f_branch2a", "class_name": "Conv2D", "config": {"name": "res1f_branch2a", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [5, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_153", 0, 0, {}]]]}, {"name": "bn1f_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn1f_branch2a", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1f_branch2a", 0, 0, {}]]]}, {"name": "activation_154", "class_name": "Activation", "config": {"name": "activation_154", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1f_branch2a", 0, 0, {}]]]}, {"name": "res1f_branch2b", "class_name": "Conv2D", "config": {"name": "res1f_branch2b", "trainable": true, "filters": 256, "kernel_size": [5, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_154", 0, 0, {}]]]}, {"name": "bn1f_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn1f_branch2b", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1f_branch2b", 0, 0, {}]]]}, {"name": "activation_155", "class_name": "Activation", "config": {"name": "activation_155", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1f_branch2b", 0, 0, {}]]]}, {"name": "res1f_branch2c", "class_name": "Conv2D", "config": {"name": "res1f_branch2c", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_155", 0, 0, {}]]]}, {"name": "res1f_branch1", "class_name": "Conv2D", "config": {"name": "res1f_branch1", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [5, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_153", 0, 0, {}]]]}, {"name": "bn1f_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn1f_branch2c", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1f_branch2c", 0, 0, {}]]]}, {"name": "bn1f_branch1", "class_name": "BatchNormalization", "config": {"name": "bn1f_branch1", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["res1f_branch1", 0, 0, {}]]]}, {"name": "add_52", "class_name": "Add", "config": {"name": "add_52", "trainable": true}, "inbound_nodes": [[["bn1f_branch2c", 0, 0, {}], ["bn1f_branch1", 0, 0, {}]]]}, {"name": "activation_156", "class_name": "Activation", "config": {"name": "activation_156", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_52", 0, 0, {}]]]}], "input_layers": [["input_25", 0, 0]], "output_layers": [["activation_156", 0, 0]]}, "inbound_nodes": [[["input_28", 0, 0, {}]]]}, {"name": "model_18", "class_name": "Model", "config": {"name": "model_18", "layers": [{"name": "input_27", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1, 512], "dtype": "float32", "sparse": false, "name": "input_27"}, "inbound_nodes": []}, {"name": "input_26", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1, 512], "dtype": "float32", "sparse": false, "name": "input_26"}, "inbound_nodes": []}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcwwAAAB0AGoBfABkA4MCUwApBE7pAQAAAOn0AQAAKQRyAQAA\nAHIBAAAAcgIAAAByAQAAACkC2gFL2gR0aWxlKQHaAWypAHIGAAAA+iA8aXB5dGhvbi1pbnB1dC01\nODMtYWIxOGQ2MWUxZTZiPtoIPGxhbWJkYT4JAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_27", 0, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcwwAAAB0AGoBfABkA4MCUwApBE7pAQAAAOn0AQAAKQRyAQAA\nAHIBAAAAcgIAAAByAQAAACkC2gFL2gR0aWxlKQHaAWypAHIGAAAA+iA8aXB5dGhvbi1pbnB1dC01\nODMtYWIxOGQ2MWUxZTZiPtoIPGxhbWJkYT4HAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"name": "permute_6", "class_name": "Permute", "config": {"name": "permute_6", "trainable": true, "dims": [2, 1, 3]}, "inbound_nodes": [[["lambda_17", 0, 0, {}]]]}, {"name": "multiply_6", "class_name": "Multiply", "config": {"name": "multiply_6", "trainable": true}, "inbound_nodes": [[["lambda_16", 0, 0, {}], ["permute_6", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QMAAABUKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA3N1bSkB2gFsqQByBwAAAPogPGlweXRob24taW5wdXQtNTgzLWFi\nMThkNjFlMWU2Yj7aCDxsYW1iZGE+DwAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["multiply_6", 0, 0, {}]]]}], "input_layers": [["input_26", 0, 0], ["input_27", 0, 0]], "output_layers": [["lambda_18", 0, 0]]}, "inbound_nodes": [[["model_17", 1, 0, {}], ["model_17", 1, 0, {}]]]}], "input_layers": [["input_28", 0, 0]], "output_layers": [["model_18", 1, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}